Revit 2027 API
HostedSweep.SetEndPointParameter Method
Set segment's start point or end point parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SetEndPointParameter(
	Reference targetRef,
	int endIdx,
	double param
)
Public Function SetEndPointParameter (
	targetRef As Reference,
	endIdx As Integer,
	param As Double
) As Boolean
public:
bool SetEndPointParameter(
	Reference^ targetRef,
	int endIdx,
	double param
)
member SetEndPointParameter :
        targetRef : Reference *
        endIdx : int *
        param : float -> bool
Parameters
targetRef Reference
Segment's reference whose parameter want to be set.
endIdx Int32
Start point (=0) or end point (=1).
param Double
Value of parameter.
Return Value
Boolean
true if operation success.
Exceptions
Exception | Condition
InvalidOperationException | Thrown when regeneration fails.
See Also
Reference
HostedSweep Class
Autodesk.Revit.DB Namespace